In [21]:
import numpy as np
import pandas as pd

In [22]:
labels = ['a','b','c']
my_data =(10,20,30)
arr = np.array(my_data)

In [23]:
arr

array([10, 20, 30])

In [24]:
d ={'a':10,'b':20,'c':30}

In [25]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [26]:
d

{'a': 10, 'b': 20, 'c': 30}

In [27]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [28]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [29]:
ser1= pd.Series([1,2,3,5],['USA','Germany','Italy','Japan'])

In [30]:
ser1

USA        1
Germany    2
Italy      3
Japan      5
dtype: int64

In [31]:
ser3 = pd.Series(data=labels)

In [32]:
ser3 + ser1

0          NaN
1          NaN
2          NaN
Germany    NaN
Italy      NaN
Japan      NaN
USA        NaN
dtype: object

In [33]:
ser1 + ser3 +ser1

0          NaN
1          NaN
2          NaN
Germany    NaN
Italy      NaN
Japan      NaN
USA        NaN
dtype: object

# Gets same random numbers everytime

In [61]:
from numpy.random import randn

In [62]:
np.random.seed(101)

In [76]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['L','M','N','O'])

In [77]:
df

          L         M         N         O
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [78]:
pd.Series(data=[1],index=['a'])

a    1
dtype: int64

In [90]:
df[['L','M']]

          L         M
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [94]:
df['L']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: L, dtype: float64

In [95]:
df['new_col'] = df['L']+df['M']

In [96]:
df['new_col']

A    1.996388
B    0.255687
C    0.880666
D   -1.251174
E    1.784981
Name: new_col, dtype: float64

In [97]:
df

          L         M         N         O   new_col
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [101]:
df.drop('new_col', axis = 1)

          L         M         N         O
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [102]:
df

          L         M         N         O   new_col
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [105]:
df.drop('new_col', axis = 1, inplace = True)

In [106]:
df

          L         M         N         O
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [107]:
df.drop('E', inplace = True)

In [108]:
df

          L         M         N         O
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [111]:
df.shape

(4, 4)

In [112]:
#rows

In [113]:
df

          L         M         N         O
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [118]:
df.loc['A'] 
#takes row name

L    0.302665
M    1.693723
N   -1.706086
O   -1.159119
Name: A, dtype: float64

In [119]:
df.iloc[1]
#takes index

L   -0.134841
M    0.390528
N    0.166905
O    0.184502
Name: B, dtype: float64

In [120]:
df.loc['B','O']

0.18450185928224264

In [121]:
df.loc[['A','C'],['N','O']]

          N         O
A -1.706086 -1.159119
C  0.638787  0.329646

In [124]:
df.iloc[[1,0],[0,3]]

          L         O
B -0.134841  0.184502
A  0.302665 -1.159119